FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ДополнительныеРеквизитыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеРеквизитыНоменклатуры</Name>
			<Comment>Второстепенные и изменяемые во времени данные номенклатуры, которые могут отличаться для разных подразделений</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Comment>Значение реквизита</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
					<Comment>Вид дополнительного реквизита</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ДополнительныеРеквизитыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ДополнительныеРеквизитыНоменклатуры/Ext/RecordSetModule.bsl
// Получение минимального складского остатка номенклатуры
// Параметры
//  Номенклатура – СправочникСсылка.Номенклатура – ссылка на номенклатуру
//  ПодразделениеКомпании – СправочникСсылка.ПодразделенияКомпании – ссылка на подразделение компании
//  НаДату – Дата – дата расчетов
// Возвращаемое значение:
//   Число или Неопределено – минимальный складской остаток
//
Функция ПолучитьМинимальныйСкладскойОстаток(Номенклатура, ПодразделениеКомпании, НаДату = Неопределено) Экспорт
	Если НаДату = Неопределено Тогда
		ДатаРасчетов = КонецДня(ТекущаяДата());
	Иначе
		ДатаРасчетов = КонецДня(НаДату);
	КонецЕсли; 
	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	ДополнительныеРеквизитыНоменклатурыСрезПоследних.ЗначениеРеквизита КАК МинимальныйОстаток
		|ИЗ
		|	РегистрСведений.ДополнительныеРеквизитыНоменклатуры.СрезПоследних КАК ДополнительныеРеквизитыНоменклатурыСрезПоследних
		|ГДЕ
		|	ДополнительныеРеквизитыНоменклатурыСрезПоследних.ДополнительныйРеквизит = &ДополнительныйРеквизит И
		|	ДополнительныеРеквизитыНоменклатурыСрезПоследних.Номенклатура = &Номенклатура И
		|	ДополнительныеРеквизитыНоменклатурыСрезПоследних.ПодразделениеКомпании = &ПодразделениеКомпании
		|");
	Запрос.УстановитьПараметр("ДополнительныйРеквизит",Перечисления.ДополнительныеРеквизитыНоменклатуры.МинимальныйОстаток);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ПодразделениеКомпании",ПодразделениеКомпании);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.МинимальныйОстаток;
	Иначе
		Если ПодразделениеКомпании<>Справочники.ПодразделенияКомпании.ПустаяСсылка() Тогда
			Возврат ПолучитьМинимальныйСкладскойОстаток(Номенклатура, ПодразделениеКомпании.Родитель, НаДату);
		Иначе
			Возврат Неопределено;
		КонецЕсли; 
	КонецЕсли; 
КонецФункции // ПолучитьМинимальныйСкладскойОстаток()
